oyf518/esp32-nes-card/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# 注:ESP32-C3 无 PSRAM,故不设 CONFIG_SPIRAM;帧缓冲全部放 SRAM。

# --- Flash ---
# FoloToy AI Passport 的所有硬件批次均使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 烧录时按实际探测容量回写镜像头。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y

# --- 控制台:USB-Serial-JTAG(C3 原生 USB,GPIO18/19)---
# 不用 UART0:其默认 TX=GPIO21 与本板背光引脚冲突。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- 系统 ---
CONFIG_FREERTOS_HZ=1000
# 自定义分区表:预留 1MB storage 分区以后放 ROM。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- 编译优化 ---
# 模拟器是 CPU 密集负载,全局 -O2;默认 -Og 跑不满帧率。
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# 老代码(nofrendo 2.0)警告多,不因警告中断构建。
CONFIG_COMPILER_WARN_WRITE_STRINGS=n

# --- BLE 手柄(NimBLE host,BLE-only;C3 无经典蓝牙)---
# 参考 ~/esp/esp-idf/examples/bluetooth/esp_hid_host 的 NimBLE 变体(sdkconfig.ci.nimble)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# 注意:不能关 ROLE_PERIPHERAL —— BT_NIMBLE_HID_SERVICE 依赖 GATT_SERVER,
# 而 GATT_SERVER 依赖 ROLE_PERIPHERAL;广播角色用不到,关掉省点 DRAM
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
# 一个手柄一条连接足够,默认 3 条白占控制器/主机内存
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
# esp_hid 的 NimBLE host 后端(nimble_hidh.c)由该开关编译进固件,默认 n 必须开
CONFIG_BT_NIMBLE_HID_SERVICE=y
# bond 配对信息落 NVS,重连免配对(默认 n)
CONFIG_BT_NIMBLE_NVS_PERSIST=y
# 内存池瘦身:C3 堆仅 ~137KB,NimBLE 全开时菜单态 free 仅 22KB,游戏加载要
# 分配的 8.5KB 电池 RAM 都放不下(实测)。HID 手柄单连接只收 ~20B 小包,
# 缓冲减半不影响稳定性;再挤不出内存就只能砍 BLE 功能了。
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=8
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_COUNT=12
CONFIG_BT_NIMBLE_TRANSPORT_ACL_FROM_LL_COUNT=12
CONFIG_BT_CTRL_BLE_MAX_ACT=4
